app/Controllers/Products.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();

INSERT INTO `products` (`name`, `description`, `price`) VALUES ('malindu', 'klkyghjo', '79')
---
    public function store()
    {
        $model = new ProductModel();
        $data = [
            'name' => $this->request->getPost('name'),
            'description' => $this->request->getPost('description'),
            'price' => $this->request->getPost('price')
            ,'date' => $this->request->getPost('date')
        ];
        $model->insert($data);

SELECT *
FROM `products`
WHERE `products`.`id` = '5'
---
    public function edit($id)
    {
        $model = new ProductModel();
        $data['product'] = $model->find($id);

DELETE FROM `products`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $model = new ProductModel();
        $model->delete($id);